#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform
module.backend.random_pet.pet_name: Refreshing state... [id=native-buzzard]
module.frontend.random_pet.pet_name: Refreshing state... [id=humble-grackle]
module.frontend.module.asp.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001]
module.backend.module.asp.module.rgp.azurerm_resource_group.rgp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001]
module.frontend.module.asp.azurerm_service_plan.asp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Web/serverFarms/prod-asp-cis-neubank-use-001]
module.backend.module.asp.azurerm_service_plan.asp: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Web/serverFarms/prod-asp-cis-neubank-use-001]
module.backend.azurerm_linux_web_app.backend_linux_web_app: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Web/sites/prod-backend-native-buzzard-service-cis-neubank-use-001]
module.frontend.azurerm_linux_web_app.backend_linux_web_app: Refreshing state... [id=/subscriptions/0aefc6aa-dc19-476c-8bd2-37c1708fd084/resourceGroups/prod-rgp-cis-neubank-use-001/providers/Microsoft.Web/sites/prod-backend-humble-grackle-service-cis-neubank-use-001]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.vnet.azurerm_virtual_network.vnet will be created
  + resource "azurerm_virtual_network" "vnet" {
      + address_space       = [
          + "10.0.0.0/16",
        ]
      + dns_servers         = (known after apply)
      + guid                = (known after apply)
      + id                  = (known after apply)
      + location            = "eastus"
      + name                = "prod-vnet-cis-neubank"
      + resource_group_name = "prod-rgp-cis-neubank-use-001"
      + subnet              = (known after apply)
      + tags                = {
          + "Environment" = "Test"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

  # module.vnet.module.rgp.azurerm_resource_group.rgp will be created
  + resource "azurerm_resource_group" "rgp" {
      + id       = (known after apply)
      + location = "eastus"
      + name     = "prod-rgp-cis-neubank-use-001"
      + tags     = {
          + "Environment" = "Test"
          + "Owner"       = "first.last@company.com"
          + "Project"     = "Mortgage Calculator"
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Warning: Value for undeclared variable

The root module does not declare a variable named "shortenv" but a value was
found in file "test.auto.tfvars". If you meant to use this value, add a
"variable" block to the configuration.

To silence these warnings, use TF_VAR_... environment variables to provide
certain "global" settings to all configurations in your organization. To
reduce the verbosity of these warnings, use the -compact-warnings option.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @dbwest, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform Prod`*